 <a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>

In [11]:
import pandas as pd
import numpy as np

# 데이터 집계와 그룹 연산

## 집계 연산(Aggregation)



|집계|설명|
|:--|:--|
|`info`| 기본적인 정보 |
|`shape`| row, columns 갯수|
|```count```|전체 갯수|
|```head```, ```tail```|앞의 항목 일부 반환, 뒤의 항목 일부 반환|
|```describe```|Series, DataFrame의 각 컬럼에 대한 요약 통계|
|```min```, ```max```|최소값, 최대값|
|```cummin```, ```cummax```|누적 최소값, 누적 최대값|
|```argmin```, ```argmax```|최소값과 최대값의 색인 위치|
|`idxmin`, `idxmax`|최소값과 최대값의 색인값|
|```mean```,```median```|평균값, 중앙값|
|```std```, ```var```|표준편차, 분산|
|```skew```|왜도 값 계산|
|```kurt```|첨도 값 계산|
|```mad```|절대 평균 편차|
|```sum```, ```cusum```|전체 항목 합, 누적합|
|```prod```, ```cumprod```|전체 항목 곱, 누적곱|
|```quatile```|0부터 1까지의 분위수 계산|
|```diff```|1차 산술차 계산|
|```pct_change```|퍼센트 변화율 계산|
|`corr`, `cov`|상관관계, 공분산 계산|

In [12]:
df = pd.DataFrame( [[1, 1.2, np.nan],
                    [2.4, 5.5, 4.2],
                    [np.nan, np.nan, np.nan],
                    [0.44, -3.1, -4.1]],
                    index=[1, 2, 3, 4],
                    columns=['A', 'B', 'C'])
df

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

In [13]:
df.head(2)

     A    B    C
1  1.0  1.2  NaN
2  2.4  5.5  4.2

In [14]:
df.tail(2)

      A    B    C
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

In [15]:
df.describe()

              A     B         C
count  3.000000  3.00  2.000000
mean   1.280000  1.20  0.050000
std    1.009554  4.30  5.868986
min    0.440000 -3.10 -4.100000
25%    0.720000 -0.95 -2.025000
50%    1.000000  1.20  0.050000
75%    1.700000  3.35  2.125000
max    2.400000  5.50  4.200000

In [16]:
df

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

In [17]:
# print(df)
print(np.argmin(df), np.argmax(df))

2 2

In [18]:
print(df.idxmin())
print(df.idxmax())

A    4
B    4
C    4
dtype: int64
A    2
B    2
C    2
dtype: int64

In [19]:
print(df)
print(df.std())
print(df.var())

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
A    1.009554
B    4.300000
C    5.868986
dtype: float64
A     1.0192
B    18.4900
C    34.4450
dtype: float64

In [20]:
print(df)
print(df.skew())
print(df.kurt())

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
A    1.15207
B    0.00000
C        NaN
dtype: float64
A   NaN
B   NaN
C   NaN
dtype: float64

In [21]:
print(df)
print(df.sum())
print(df.cumsum())

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
A    3.84
B    3.60
C    0.10
dtype: float64
      A    B    C
1  1.00  1.2  NaN
2  3.40  6.7  4.2
3   NaN  NaN  NaN
4  3.84  3.6  0.1

In [22]:
print(df)
print(df.prod())
print(df.cumprod())

      A    B    C
1  1.00  1.2  NaN
2  2.40  5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1
A     1.056
B   -20.460
C   -17.220
dtype: float64
       A      B      C
1  1.000   1.20    NaN
2  2.400   6.60   4.20
3    NaN    NaN    NaN
4  1.056 -20.46 -17.22

In [23]:
df.diff()

     A    B   C
1  NaN  NaN NaN
2  1.4  4.3 NaN
3  NaN  NaN NaN
4  NaN  NaN NaN

In [24]:
df.quantile()

A    1.00
B    1.20
C    0.05
Name: 0.5, dtype: float64

In [25]:
df.pct_change()

          A         B        C
1       NaN       NaN      NaN
2  1.400000  3.583333      NaN
3  0.000000  0.000000  0.00000
4 -0.816667 -1.563636 -1.97619

In [26]:
df.corr()

          A         B    C
A  1.000000  0.970725  1.0
B  0.970725  1.000000  1.0
C  1.000000  1.000000  1.0

In [27]:
df.corrwith(df.B)

A    0.970725
B    1.000000
C    1.000000
dtype: float64

In [28]:
df.cov()

        A       B       C
A  1.0192   4.214   8.134
B  4.2140  18.490  35.690
C  8.1340  35.690  34.445

In [29]:
df['B'].unique()

array([ 1.2,  5.5,  nan, -3.1])

In [30]:
df['A'].value_counts()

0.44    1
2.40    1
1.00    1
Name: A, dtype: int64

## GroupBy 연산

In [31]:
df = pd.DataFrame({'c1':['a', 'a', 'b', 'b', 'c', 'd', 'b'],
                   'c2':['A', 'B', 'B', 'A', 'D', 'C', 'C'],
                   'c3':np.random.randint(7),
                   'c4':np.random.random(7)})
df

  c1 c2  c3        c4
0  a  A   0  0.631563
1  a  B   0  0.526280
2  b  B   0  0.211337
3  b  A   0  0.816578
4  c  D   0  0.297802
5  d  C   0  0.369753
6  b  C   0  0.766533

In [32]:
df.dtypes

c1     object
c2     object
c3      int64
c4    float64
dtype: object

In [33]:
df['c3'].groupby(df['c1']) # groupby는 객체일뿐

In [34]:
df['c3'].groupby(df['c1']).mean()

c1
a    0
b    0
c    0
d    0
Name: c3, dtype: int64

In [35]:
df['c4'].groupby(df['c2']).std()

c2
A    0.130825
B    0.222698
C    0.280566
D         NaN
Name: c4, dtype: float64

In [36]:
df['c4'].groupby([df['c1'], df['c2']]).mean()

c1  c2
a   A     0.631563
    B     0.526280
b   A     0.816578
    B     0.211337
    C     0.766533
c   D     0.297802
d   C     0.369753
Name: c4, dtype: float64

In [37]:
df['c4'].groupby([df['c1'], df['c2']]).mean().unstack()

c2         A         B         C         D
c1
a   0.631563  0.526280       NaN       NaN
b   0.816578  0.211337  0.766533       NaN
c        NaN       NaN       NaN  0.297802
d        NaN       NaN  0.369753       NaN

In [38]:
df.groupby('c1').mean()

    c3        c4
c1
a    0  0.578922
b    0  0.598149
c    0  0.297802
d    0  0.369753

In [39]:
df.groupby(['c1', 'c2']).mean()

       c3        c4
c1 c2
a  A    0  0.631563
   B    0  0.526280
b  A    0  0.816578
   B    0  0.211337
   C    0  0.766533
c  D    0  0.297802
d  C    0  0.369753

In [40]:
df.groupby(['c1', 'c2']).size()

c1  c2
a   A     1
    B     1
b   A     1
    B     1
    C     1
c   D     1
d   C     1
dtype: int64

In [41]:
for c1, group in df.groupby('c1'):
    print(c1)
    print(group)

a
  c1 c2  c3        c4
0  a  A   0  0.631563
1  a  B   0  0.526280
b
  c1 c2  c3        c4
2  b  B   0  0.211337
3  b  A   0  0.816578
6  b  C   0  0.766533
c
  c1 c2  c3        c4
4  c  D   0  0.297802
d
  c1 c2  c3        c4
5  d  C   0  0.369753

In [42]:
for (c1, c2), group in df.groupby(['c1','c2']):
    print((c1, c2))
    print(group)

('a', 'A')
  c1 c2  c3        c4
0  a  A   0  0.631563
('a', 'B')
  c1 c2  c3       c4
1  a  B   0  0.52628
('b', 'A')
  c1 c2  c3        c4
3  b  A   0  0.816578
('b', 'B')
  c1 c2  c3        c4
2  b  B   0  0.211337
('b', 'C')
  c1 c2  c3        c4
6  b  C   0  0.766533
('c', 'D')
  c1 c2  c3        c4
4  c  D   0  0.297802
('d', 'C')
  c1 c2  c3        c4
5  d  C   0  0.369753

In [43]:
df.groupby(['c1', 'c2'])[['c4']].mean()

             c4
c1 c2
a  A   0.631563
   B   0.526280
b  A   0.816578
   B   0.211337
   C   0.766533
c  D   0.297802
d  C   0.369753

In [44]:
df.groupby('c1')['c3'].quantile()

c1
a    0.0
b    0.0
c    0.0
d    0.0
Name: c3, dtype: float64

In [45]:
df.groupby('c1')['c3'].count()

c1
a    2
b    3
c    1
d    1
Name: c3, dtype: int64

In [46]:
df.groupby('c1')['c4'].median()

c1
a    0.578922
b    0.766533
c    0.297802
d    0.369753
Name: c4, dtype: float64

In [47]:
df.groupby('c1')['c4'].std()

c1
a    0.074446
b    0.335922
c         NaN
d         NaN
Name: c4, dtype: float64

In [48]:
df.groupby(['c1', 'c2'])['c4'].agg(['mean', 'min', 'max'])

           mean       min       max
c1 c2
a  A   0.631563  0.631563  0.631563
   B   0.526280  0.526280  0.526280
b  A   0.816578  0.816578  0.816578
   B   0.211337  0.211337  0.211337
   C   0.766533  0.766533  0.766533
c  D   0.297802  0.297802  0.297802
d  C   0.369753  0.369753  0.369753

In [49]:
df.groupby(['c1','c2'], as_index=False)['c4'].mean() # as_index 펄스는 그룹 인덱스를 하지 않는다.

  c1 c2        c4
0  a  A  0.631563
1  a  B  0.526280
2  b  A  0.816578
3  b  B  0.211337
4  b  C  0.766533
5  c  D  0.297802
6  d  C  0.369753

In [50]:
df.groupby(['c1','c2'], group_keys=False)['c4'].mean()

c1  c2
a   A     0.631563
    B     0.526280
b   A     0.816578
    B     0.211337
    C     0.766533
c   D     0.297802
d   C     0.369753
Name: c4, dtype: float64

In [51]:
def top(df, n=3, column='c1'):
    return df.sort_values(by=column)[-n:]

top(df, n=5)

  c1 c2  c3        c4
2  b  B   0  0.211337
3  b  A   0  0.816578
6  b  C   0  0.766533
4  c  D   0  0.297802
5  d  C   0  0.369753

In [52]:
print(df)
df.groupby('c1').apply(top)

  c1 c2  c3        c4
0  a  A   0  0.631563
1  a  B   0  0.526280
2  b  B   0  0.211337
3  b  A   0  0.816578
4  c  D   0  0.297802
5  d  C   0  0.369753
6  b  C   0  0.766533

     c1 c2  c3        c4
c1
a  0  a  A   0  0.631563
   1  a  B   0  0.526280
b  2  b  B   0  0.211337
   3  b  A   0  0.816578
   6  b  C   0  0.766533
c  4  c  D   0  0.297802
d  5  d  C   0  0.369753

## 피벗 테이블(Pivot Table)

|함수|설명|
|:-|:-|
|```values```|집계하려는 컬럼 이름 혹은 이름의 리스트. 기본적으로 모든 숫자 컬럼 집계|
|```index```|피벗테이블의 로우를 그룹으로 묶을 컬럼 이름이나 그룹 키|
|```columns```|피벗테이블의 컬럼을 그룹으로 묶을 컬럼 이름이나 그룹 키|
|```aggfunc```|집계 함수나 함수 리스트. 기본값으로 ```mean```이 사용|
|```fil_value```|결과 테이블에서 누락된 값 대체를 위한 값|
|```dropna```|True인 경우 모든 항목이 NA인 컬럼은 포함하지 않음|
|```margins```|부분 합이나 총계를 담기 위한 로우/컬럼 추가 여부. 기본값은 False|

In [53]:
df.pivot_table(['c3', 'c4'],
               index=['c1'],
               columns=['c2'])

     c3                       c4
c2    A    B    C    D         A         B         C         D
c1
a   0.0  0.0  NaN  NaN  0.631563  0.526280       NaN       NaN
b   0.0  0.0  0.0  NaN  0.816578  0.211337  0.766533       NaN
c   NaN  NaN  NaN  0.0       NaN       NaN       NaN  0.297802
d   NaN  NaN  0.0  NaN       NaN       NaN  0.369753       NaN

In [54]:
df.pivot_table(['c3', 'c4'],
               index=['c1'],
               columns=['c2'],
               margins=True) # margins : 부분함 총계

      c3                           c4
c2     A    B    C    D All         A         B         C         D       All
c1
a    0.0  0.0  NaN  NaN   0  0.631563  0.526280       NaN       NaN  0.578922
b    0.0  0.0  0.0  NaN   0  0.816578  0.211337  0.766533       NaN  0.598149
c    NaN  NaN  NaN  0.0   0       NaN       NaN       NaN  0.297802  0.297802
d    NaN  NaN  0.0  NaN   0       NaN       NaN  0.369753       NaN  0.369753
All  0.0  0.0  0.0  0.0   0  0.724070  0.368809  0.568143  0.297802  0.517121

In [55]:
df.pivot_table(['c3', 'c4'],
               index=['c1'],
               columns=['c2'],
               margins=True,
               aggfunc=sum)

      c3                           c4
c2     A    B    C    D All         A         B         C         D       All
c1
a    0.0  0.0  NaN  NaN   0  0.631563  0.526280       NaN       NaN  1.157844
b    0.0  0.0  0.0  NaN   0  0.816578  0.211337  0.766533       NaN  1.794448
c    NaN  NaN  NaN  0.0   0       NaN       NaN       NaN  0.297802  0.297802
d    NaN  NaN  0.0  NaN   0       NaN       NaN  0.369753       NaN  0.369753
All  0.0  0.0  0.0  0.0   0  1.448141  0.737618  1.136285  0.297802  3.619846

In [56]:
df.pivot_table(['c3', 'c4'],
               index=['c1'],
               columns=['c2'],
               margins=True,
               aggfunc=sum,
               fill_value=0 )

    c3                     c4
c2   A  B  C  D All         A         B         C         D       All
c1
a    0  0  0  0   0  0.631563  0.526280  0.000000  0.000000  1.157844
b    0  0  0  0   0  0.816578  0.211337  0.766533  0.000000  1.794448
c    0  0  0  0   0  0.000000  0.000000  0.000000  0.297802  0.297802
d    0  0  0  0   0  0.000000  0.000000  0.369753  0.000000  0.369753
All  0  0  0  0   0  1.448141  0.737618  1.136285  0.297802  3.619846

In [57]:
pd.crosstab(df.c1, df.c2)

c2  A  B  C  D
c1
a   1  1  0  0
b   1  1  1  0
c   0  0  0  1
d   0  0  1  0

In [58]:
pd.crosstab(df.c1, df.c2, values=df.c3, aggfunc=sum, margins=True)

c2     A    B    C    D  All
c1
a    0.0  0.0  NaN  NaN    0
b    0.0  0.0  0.0  NaN    0
c    NaN  NaN  NaN  0.0    0
d    NaN  NaN  0.0  NaN    0
All  0.0  0.0  0.0  0.0    0

## 범주형(Categorical) 데이터

- 성능을 향상시키기 위한 데이터 유형
<br>  
<br>

|메소드|설명|
|:--|:--|
|```add_categories```|기존 카테고리에 새로운 카테고리 추가|
|```as_ordered```|카테고리에 순서 지정|
|```as_unordered```|카테고리에 순서 미지정|
|```remove_categories```|카테고리 제거|
|```remove_unused_categories```|사용하지 않는 카테고리 제거|
|```rename_categories```|카테고리 이름 변경|
|```reorder_categories```|새로운 카테고리에 순서 지정|
|```set_categories```|새로운 카테고리로 변경|

In [59]:
s = pd.Series(['c1', 'c2', 'c1', 'c2', 'c2'] * 2)
s

0    c1
1    c2
2    c1
3    c2
4    c2
5    c1
6    c2
7    c1
8    c2
9    c2
dtype: object

In [60]:
pd.unique(s)

array(['c1', 'c2'], dtype=object)

In [61]:
pd.value_counts(s)

c2    6
c1    4
dtype: int64

In [62]:
code = pd.Series([0, 1, 0, 1, 0] * 2)
code

0    0
1    1
2    0
3    1
4    0
5    0
6    1
7    0
8    1
9    0
dtype: int64

In [63]:
d = pd.Series(['c1', 'c2'])
d

0    c1
1    c2
dtype: object

In [64]:
d.take(code)

0    c1
1    c2
0    c1
1    c2
0    c1
0    c1
1    c2
0    c1
1    c2
0    c1
dtype: object

In [65]:
df = pd.DataFrame({ 'id' : np.arange(len(s)),
                    'c' : s, 
                    'v' : np.random.randint(1000, 5000, size=len(s))})
df

   id   c     v
0   0  c1  1245
1   1  c2  2900
2   2  c1  3975
3   3  c2  2996
4   4  c2  3979
5   5  c1  2349
6   6  c2  1086
7   7  c1  3552
8   8  c2  2686
9   9  c2  3962

In [66]:
c = df['c'].astype('category')
c

0    c1
1    c2
2    c1
3    c2
4    c2
5    c1
6    c2
7    c1
8    c2
9    c2
Name: c, dtype: category
Categories (2, object): ['c1', 'c2']

In [67]:
c.values

['c1', 'c2', 'c1', 'c2', 'c2', 'c1', 'c2', 'c1', 'c2', 'c2']
Categories (2, object): ['c1', 'c2']

In [68]:
c.values.categories

Index(['c1', 'c2'], dtype='object')

In [69]:
c.values.codes

array([0, 1, 0, 1, 1, 0, 1, 0, 1, 1], dtype=int8)

In [70]:
df['c'] = c
df.c

0    c1
1    c2
2    c1
3    c2
4    c2
5    c1
6    c2
7    c1
8    c2
9    c2
Name: c, dtype: category
Categories (2, object): ['c1', 'c2']

In [71]:
c = pd.Categorical(['c1', 'c2', 'c3', 'c1', 'c2'])
c

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1', 'c2', 'c3']

In [72]:
categories = ['c1', 'c2', 'c3']
codes = [0, 1, 2, 0, 1]
c = pd.Categorical.from_codes(codes, categories)
c

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1', 'c2', 'c3']

In [73]:
pd.Categorical.from_codes(codes, categories, ordered=True)

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1' < 'c2' < 'c3']

In [74]:
c.as_ordered()

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1' < 'c2' < 'c3']

In [75]:
c.codes

array([0, 1, 2, 0, 1], dtype=int8)

In [76]:
c.categories

Index(['c1', 'c2', 'c3'], dtype='object')

In [77]:
c = c.set_categories(['c1', 'c2', 'c3', 'c4', 'c5'])
c.categories

Index(['c1', 'c2', 'c3', 'c4', 'c5'], dtype='object')

In [78]:
c.value_counts()

c1    2
c2    2
c3    1
c4    0
c5    0
dtype: int64

In [79]:
c[c.isin(['c1','c3','c4'])]

['c1', 'c3', 'c1']
Categories (5, object): ['c1', 'c2', 'c3', 'c4', 'c5']

In [80]:
c = c.remove_unused_categories() # 사용하지 않은 항목 제거

In [81]:
c.categories

Index(['c1', 'c2', 'c3'], dtype='object')

###### 출처: 
* <a href='https://github.com/SeWonKwon' ><div> <img src ='https://slid-capture.s3.ap-northeast-2.amazonaws.com/public/image_upload/6556674324ed41a289a354258718280d/964e5a8b-75ad-41fc-ae75-0ca66d06fbc7.png' align='left' /> </div></a>


<br>


* [이수안컴퓨터연구소](https://www.youtube.com/channel/UCFfALXX0DOx7zv6VeR5U_Bg)
* https://github.com/minsuk-heo/pandas